In [1]:
import numpy as np
import pandas as pd

# 1.Series：

In [2]:
s1 = pd.Series([1,2,5,6,np.nan],index=['a','b','c','d','e'])
s1

a    1.0
b    2.0
c    5.0
d    6.0
e    NaN
dtype: float64

In [3]:
s2 = pd.Series([9,np.nan,np.nan,7,8],index=['b','c','d','e','f'])
s2

b    9.0
c    NaN
d    NaN
e    7.0
f    8.0
dtype: float64

In [4]:
s1.combine_first(s2)

a    1.0
b    2.0
c    5.0
d    6.0
e    7.0
f    8.0
dtype: float64

In [5]:
s2.combine_first(s1)

a    1.0
b    9.0
c    5.0
d    6.0
e    7.0
f    8.0
dtype: float64

# 2.DataFrame：

In [6]:
df1 = pd.DataFrame({'a':[2,np.nan,6,np.nan],'b':[np.nan,5,np.nan,8],'c':[11,22,33,44]})
df1

     a    b   c
0  2.0  NaN  11
1  NaN  5.0  22
2  6.0  NaN  33
3  NaN  8.0  44

In [7]:
df2 = pd.DataFrame({'a':[5.5,4.4,np.nan,3.3,2.2],'b':[np.nan,3.3,4.4,5.5,6.6]})
df2

     a    b
0  5.5  NaN
1  4.4  3.3
2  NaN  4.4
3  3.3  5.5
4  2.2  6.6

In [8]:
df1.combine_first(df2)

     a    b     c
0  2.0  NaN  11.0
1  4.4  5.0  22.0
2  6.0  4.4  33.0
3  3.3  8.0  44.0
4  2.2  6.6   NaN

In [9]:
df2.combine_first(df1)

     a    b     c
0  5.5  NaN  11.0
1  4.4  3.3  22.0
2  6.0  4.4  33.0
3  3.3  5.5  44.0
4  2.2  6.6   NaN